In [5]:
import pandas as pd
print(pd.__version__)

1.4.2

In [6]:
# Create a pandas series with custom index
A = pd.Series([2,5,4,6],index = ['a','b','c','d'])
A,type(A)

(a    2
 b    5
 c    4
 d    6
 dtype: int64,
 pandas.core.series.Series)

In [7]:
A.values

array([2, 5, 4, 6], dtype=int64)

In [8]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
type(A.values)

numpy.ndarray

In [10]:
type(A.index)

pandas.core.indexes.base.Index

In [11]:
type(A)

pandas.core.series.Series

In [12]:
# Acces value at index 'a'
A['a']

2

In [13]:
# Access elements fro'a' to 'c' [start:end:step]
A['a':'c']   # You see that? it unlike numpy slicing it is including end index

a    2
b    5
c    4
dtype: int64

In [14]:
# School grade series
grades_dict = {'A':4.5,'B':4,'C':3.5,'D':3,'P':2.5,'F':2}
grade_series = pd.Series(grades_dict)
grade_series

A    4.5
B    4.0
C    3.5
D    3.0
P    2.5
F    2.0
dtype: float64

In [15]:
# what GPA required for grade A?
grade_series['A']

4.5

In [16]:
marks_dict = {'A':85,'B':80,'C':75,'D':70,'P':65,'F':60}
marks_series = pd.Series(marks_dict)
marks_series

A    85
B    80
C    75
D    70
P    65
F    60
dtype: int64

In [17]:
# Find marks required for grade A,B and C
marks_series['A':'C']

A    85
B    80
C    75
dtype: int64

In [18]:
marks_series[0:2]   # We can also access elements using number

A    85
B    80
dtype: int64

In [19]:
Data = pd.DataFrame({'Marks':marks_dict,'Grades':grades_dict})
Data

   Marks  Grades
A     85     4.5
B     80     4.0
C     75     3.5
D     70     3.0
P     65     2.5
F     60     2.0

In [20]:
Data.T # it interchanges rows and columns

           A     B     C     D     P     F
Marks   85.0  80.0  75.0  70.0  65.0  60.0
Grades   4.5   4.0   3.5   3.0   2.5   2.0

In [21]:
# Show values of the data
Data.values

array([[85. ,  4.5],
       [80. ,  4. ],
       [75. ,  3.5],
       [70. ,  3. ],
       [65. ,  2.5],
       [60. ,  2. ]])

In [22]:
# Show columns of the data
Data.columns

Index(['Marks', 'Grades'], dtype='object')

In [23]:
# Add another column scaled marks
Data['scaled_marks'] = 100*(Data['Marks']/90)

In [24]:
Data

   Marks  Grades  scaled_marks
A     85     4.5     94.444444
B     80     4.0     88.888889
C     75     3.5     83.333333
D     70     3.0     77.777778
P     65     2.5     72.222222
F     60     2.0     66.666667

In [25]:
# Now remove scaled marks column from the dataframe
del(Data['scaled_marks'])

In [26]:
Data

   Marks  Grades
A     85     4.5
B     80     4.0
C     75     3.5
D     70     3.0
P     65     2.5
F     60     2.0

In [27]:
# Show data only greater than 70 marks
Data[Data['Marks']>70]

   Marks  Grades
A     85     4.5
B     80     4.0
C     75     3.5

In [28]:
# Create a DataFrame with some missing values
df = pd.DataFrame([{'a':4.5,'b':4},{'b':4,'c':3.5}])
df

     a  b    c
0  4.5  4  NaN
1  NaN  4  3.5

In [29]:
# Check for missing values
df.isnull()  # Wherever it is showing true that means there is missing values

       a      b      c
0  False  False   True
1   True  False  False

In [30]:
# We can also use isnull().any()
df.isnull().any()  # Wherever it is showing true that means there is missing values

a     True
b    False
c     True
dtype: bool

In [31]:
df.isnull().any(axis = 1)

0    True
1    True
dtype: bool

In [42]:
# Fill the missing values with some number
df.fillna(0)

     a  b    c
0  4.5  4  0.0
1  0.0  4  3.5

In [33]:
# Drop the column of missing values
df.dropna(axis = 1)  # Drop all columns having missing values

   b
0  4
1  4

In [34]:
series = pd.Series(['a','b','c'],index = [1,3,5])
series

1    a
3    b
5    c
dtype: object

###### In the above series [1,3,5] are explicit indices while there is also implicit indices associated with ['a','b','c']
###### There are two function in pandas to handle implicit and explicit indices:
* `loc` if this is called means we are using expliciit indices

* `iloc` If this is called means we are using implicit indices

In [35]:
series[1:3]  # If we use these kind of slicing then it acces element using implicit indices

3    b
5    c
dtype: object

In [36]:
# Call loc to use explicit indices
series.loc[1:3]

1    a
3    b
dtype: object

In [37]:
# Call iloc to use implicit indices
series.iloc[1:3]

3    b
5    c
dtype: object

In [38]:
Data

   Marks  Grades
A     85     4.5
B     80     4.0
C     75     3.5
D     70     3.0
P     65     2.5
F     60     2.0

In [39]:
Data.iloc[1:3]

   Marks  Grades
B     80     4.0
C     75     3.5

In [40]:
Data[1:3]

   Marks  Grades
B     80     4.0
C     75     3.5

In [41]:
Data[::-1]  # Reverse all the rows

   Marks  Grades
F     60     2.0
P     65     2.5
D     70     3.0
C     75     3.5
B     80     4.0
A     85     4.5